Repository: KarimYasser15/kafa2a
Catalog: lib/l10n/app_*.arb
Languages: ar

source: User
ar: مستخدم

source: Service Provider
ar: مقدم الخدمة

source: Welcome,
ar: أهلاً وسهلاً،

# slogan
source: Skilled Hands, Anytime, Anywhere!
ar: إيد ماهرين، في أي وقت وفي أي مكان!

source: Login
ar: تسجيل دخول

source: Email
ar: الإيميل

source: Password
ar: كلمة السر

source: National ID
ar: الرقم القومي

source: Address
ar: العنوان

source: Confirm Password
ar: تأكيد كلمة السر

source: Enter Your Email
ar: اكتب إيميلك

source: Enter Your Password
ar: اكتب كلمة السر

source: Don't Have An Account?
ar: ماعندكش حساب؟

source: Already Have An Account?
ar: عندك حساب قبل كده؟

source: Enter Your Phone Number
ar: اكتب رقم تليفونك

source: Enter Your Name
ar: اكتب اسمك

source: Enter Your National Id
ar: اكتب الرقم القومي

source: Enter Your Address
ar: اكتب عنوانك

source: Register
ar: انشاء حساب

source: Name
ar: الاسم

source: Phone Number
ar: رقم التليفون

source: Home
ar: الصفحة الرئيسية

source: My Requests
ar: طلباتي

source: Accepted Requests
ar: الطلبات المقبولة

source: Chats
ar: الرسائل

source: My Profile
ar: الملف الشخصي

source: Open
ar: مستنيا عروض

source: Accepted
ar: اتقبلت

source: Completed
ar: خلصت

source: Cancelled
ar: اتلغت

source: Filter
ar: تصفية

source: Offers
ar: العروض

source: Offer
ar: عرض

source: Cancel Request
ar: إلغاء الطلب

source: Request Service
ar: اطلب خدمة

# providerPetails
source: Provider Profile
ar: بيانات مقدم الخدمة

source: Accept Offer
ar: اقبل العرض

source: Edit Profile Photo
ar: تغيير صورة الملف

source: Log Out
ar: تسجيل خروج

source: Change Language
ar: تغيير اللغة

source: Send Offer
ar: ابعت عرض

# policeClearanceCertificate
source: Police Clearance Certrificate
ar: فيش وتشبيه

# uploadSelfie
source: Upload A Selfie
ar: ارفع صورة سيلفي

source: Take Selfie
ar: صور سيلفي

source: Pick Image
ar: اختار صورة

source: Close
ar: اقفل

source: Category
ar: الفئة

source: Select Category
ar: اختار الفئة

source: Services
ar: الخدمات

source: Select Service
ar: اختار خدمة

source: Description
ar: الوصف

source: Prefered Time
ar: الوقت المناسب

source: Price
ar: السعر

source: Please Enter Description
ar: من فضلك اكتب وصف

source: Please Enter Title
ar: من فضلك اكتب عنوان

source: Please Enter Your Price
ar: من فضلك اكتب السعر

source: Select Date and Time
ar: اختار اليوم والساعة

source: Title
ar: ايه طلبك

source: Service
ar: الخدمة

source: Location
ar: المكان

source: Time
ar: الوقت

# addressRequired
source: Please Enter Your National ID
ar: من فضلك اكتب الرقم القومي

# emailRequired
source: Please Enter Your Email
ar: من فضلك اكتب الإيميل

source: Failed to delete token
ar: فشل في مسح التوكن

source: Failed to retrieve token
ar: فشل في استرجاع التوكن

source: Failed to save token
ar: فشل في حفظ التوكن

# invalidEmail
source: Please Enter a Valid Email
ar: من فضلك اكتب إيميل صحيح

# nameRequired
source: Please Enter Your Name
ar: من فضلك اكتب اسمك

# nationalIdRequired
source: Please Enter Your National ID
ar: من فضلك اكتب الرقم القومي

# priceRequired
source: Please Enter Your Price
ar: من فضلك اكتب السعر

# titleRequired
source: Please Enter a Title
ar: من فضلك اكتب عنوان

# passwordIsSmall
source: Password must be at least 6 characters
ar: كلمة السر لازم تكون 6 حروف على الأقل

# passwordRequired
source: Please Enter Your Password
ar: من فضلك اكتب كلمة السر

source: Passwords Don't Match
ar: كلمة السر مش متطابقة

# phoneNumberRequired
source: Please Enter Your Phone Number
ar: من فضلك اكتب رقم التليفون

source: Service Requested Successfully!
ar: !طلب الخدمة اتبعت بنجاح

source: Failed to Login
ar: فشل في تسجيل الدخول

source: Failed to Register
ar: فشل في انشاء الحساب

source: Failed to log out
ar: فشل في تسجيل الخروج

source: Failed to Get Categories
ar: فشل في تحميل الفئات

source: Failed to Request Service
ar: فشل في طلب الخدمة

source: Failed to Get Requests
ar: فشل في تحميل الطلبات

source: Failed to Send Offer
ar: فشل في إرسال العرض

source: Failed to Get Pending Requests
ar: فشل في تحميل الطلبات المنتظرة

source: Failed to Get Accepted Offers
ar: فشل في تحميل العروض المقبولة

# noPendingRequetsAtTheMoment
source: No Pending Requests At The Moment!
ar: !مفيش طلبات منتظرة دلوقتي

source: No Requests At The Moment!
ar: !مفيش طلبات دلوقتي

source: Your Offer Details
ar: تفاصيل عرضك

source: Enter Your Offer
ar: أكتب عرضك

# errorMessage
source: Failed to get categories
ar: فشل في تحميل الفئات

# pickYourLocation
source: Press to Get Your Location
ar: اضغط علشان نحدد موقعك

source: No Image Selected
ar: مختارتش صورة
